{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from pprint import pprint"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from awudima import Federation, DataSource, DataSourceType, AwudimaFQP"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'fedId': 'platoon_pilot1a_fed',\n",
       " 'name': 'PLATOON Pilot1a Federation',\n",
       " 'desc': 'Federation of platoon datasets',\n",
       " 'rdfmts': [],\n",
       " 'sources': {}}"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "fed = Federation(\"platoon_pilot1a_fed\", \"PLATOON Pilot1a Federation\", \"Federation of platoon datasets\")\n",
    "fed.to_json()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'dsId': 'engie_pilot1a',\n",
       " 'name': 'pilot1a_engie',\n",
       " 'desc': 'Pilot1A data on Wind turbines',\n",
       " 'url': '0.0.0.0:27017',\n",
       " 'dstype': 'MONGODB_LD_FLAT',\n",
       " 'params': {'<http://www.wiwiss.fu-berlin.de/suhl/bizer/D2RQ/0.1#jdbcDSN>': 'pilot1a_engie',\n",
       "  'username': 'root',\n",
       "  'password': '1234'},\n",
       " 'acronym': 'ENGIE_Pilot1a_DS',\n",
       " 'labeling_property': 'http://www.w3.org/2000/01/rdf-schema#label',\n",
       " 'mappings': {},\n",
       " 'mapping_paths': [],\n",
       " 'mappings_type': None,\n",
       " 'typing_predicate': '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
       " 'policy': None}"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ds1 = DataSource(\"pilot1a_engie\",  # name of the database\n",
    "                 'engie_pilot1a',  # Id of the data source\n",
    "                 '0.0.0.0:27017',  # URL of the data source\n",
    "                 DataSourceType.MONGODB_LD_FLAT,  # type of the data source\n",
    "                 desc=\"Pilot1A data on Wind turbines\",\n",
    "                 params={\n",
    "                     \"<http://www.wiwiss.fu-berlin.de/suhl/bizer/D2RQ/0.1#jdbcDSN>\": \"pilot1a_engie\",\n",
    "                     'username': 'root',\n",
    "                     'password': '1234'\n",
    "                 },\n",
    "                 acronym='ENGIE_Pilot1a_DS')\n",
    "ds1.to_json()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "fed.addSource(ds1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'fedId': 'platoon_pilot1a_fed',\n",
       " 'name': 'PLATOON Pilot1a Federation',\n",
       " 'desc': 'Federation of platoon datasets',\n",
       " 'rdfmts': [],\n",
       " 'sources': {'engie_pilot1a': {'dsId': 'engie_pilot1a',\n",
       "   'name': 'pilot1a_engie',\n",
       "   'desc': 'Pilot1A data on Wind turbines',\n",
       "   'url': '0.0.0.0:27017',\n",
       "   'dstype': 'MONGODB_LD_FLAT',\n",
       "   'params': {'<http://www.wiwiss.fu-berlin.de/suhl/bizer/D2RQ/0.1#jdbcDSN>': 'pilot1a_engie',\n",
       "    'username': 'root',\n",
       "    'password': '1234'},\n",
       "   'acronym': 'ENGIE_Pilot1a_DS',\n",
       "   'labeling_property': 'http://www.w3.org/2000/01/rdf-schema#label',\n",
       "   'mappings': {},\n",
       "   'mapping_paths': [],\n",
       "   'mappings_type': None,\n",
       "   'typing_predicate': '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
       "   'policy': None}}}"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "fed.to_json()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0.0.0.0:27017\n",
      "----------------------\n",
      "total mts: 13\n",
      "1 ) extracting description for  0.0.0.0:27017 is done!\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{http://www.w3.org/2006/time#Instant,\n",
       " https://w3id.org/platoon/OnshoreWindTurbine,\n",
       " https://w3id.org/platoon/PositionEvaluation,\n",
       " https://w3id.org/platoon/PositionProperty,\n",
       " https://w3id.org/platoon/StatusCodeEvaluation,\n",
       " https://w3id.org/platoon/StatusCodeProperty,\n",
       " https://w3id.org/platoon/Vane,\n",
       " https://w3id.org/platoon/WindFarm,\n",
       " https://w3id.org/seas/AverageEvaluation,\n",
       " https://w3id.org/seas/MaximumEvaluation,\n",
       " https://w3id.org/seas/MinimumEvaluation,\n",
       " https://w3id.org/seas/StandardDeviationEvaluation}"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# collect RDF Molecule Templates\n",
    "fed.extract_molecules()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'fedId': 'platoon_pilot1a_fed',\n",
       " 'name': 'PLATOON Pilot1a Federation',\n",
       " 'desc': 'Federation of platoon datasets',\n",
       " 'rdfmts': [{'mtId': 'https://w3id.org/platoon/PositionProperty',\n",
       "   'mttype': 'typed',\n",
       "   'label': 'https://w3id.org/platoon/PositionProperty',\n",
       "   'desc': '',\n",
       "   'cardinality': -1,\n",
       "   'subClassOf': [],\n",
       "   'predicates': [{'predId': 'https://w3id.org/seas/evaluation',\n",
       "     'label': 'https://w3id.org/seas/evaluation',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['https://w3id.org/seas/MinimumEvaluation',\n",
       "      'https://w3id.org/seas/StandardDeviationEvaluation',\n",
       "      'https://w3id.org/platoon/PositionEvaluation',\n",
       "      'https://w3id.org/seas/MaximumEvaluation',\n",
       "      'https://w3id.org/seas/AverageEvaluation'],\n",
       "     'constraints': [],\n",
       "     'policy': None},\n",
       "    {'predId': 'http://www.w3.org/2000/01/rdf-schema#label',\n",
       "     'label': 'http://www.w3.org/2000/01/rdf-schema#label',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': [],\n",
       "     'constraints': [],\n",
       "     'policy': None}],\n",
       "   'datasources': ['engie_pilot1a'],\n",
       "   'predicate_sources': {'engie_pilot1a': ['https://w3id.org/seas/evaluation',\n",
       "     'http://www.w3.org/2000/01/rdf-schema#label']},\n",
       "   'predicate_RML_sources': {'https://w3id.org/seas/evaluation': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}],\n",
       "    'http://www.w3.org/2000/01/rdf-schema#label': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}]},\n",
       "   'instance_prefixes': [],\n",
       "   'constraints': [],\n",
       "   'policy': None,\n",
       "   'mappingIds': {}},\n",
       "  {'mtId': 'http://www.w3.org/2006/time#Instant',\n",
       "   'mttype': 'typed',\n",
       "   'label': 'http://www.w3.org/2006/time#Instant',\n",
       "   'desc': '',\n",
       "   'cardinality': -1,\n",
       "   'subClassOf': [],\n",
       "   'predicates': [{'predId': 'http://www.w3.org/2006/time#inXSDDateTime',\n",
       "     'label': 'http://www.w3.org/2006/time#inXSDDateTime',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['http://www.w3.org/2001/XMLSchema#dateTime'],\n",
       "     'constraints': [],\n",
       "     'policy': None}],\n",
       "   'datasources': ['engie_pilot1a'],\n",
       "   'predicate_sources': {'engie_pilot1a': ['http://www.w3.org/2006/time#inXSDDateTime']},\n",
       "   'predicate_RML_sources': {'http://www.w3.org/2006/time#inXSDDateTime': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'},\n",
       "     {'name': 'pilot1a_engie<|>windturbine_eventlogs',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_eventlogs',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}]},\n",
       "   'instance_prefixes': [],\n",
       "   'constraints': [],\n",
       "   'policy': None,\n",
       "   'mappingIds': {}},\n",
       "  {'mtId': 'https://w3id.org/platoon/OnshoreWindTurbine',\n",
       "   'mttype': 'typed',\n",
       "   'label': 'https://w3id.org/platoon/OnshoreWindTurbine',\n",
       "   'desc': '',\n",
       "   'cardinality': -1,\n",
       "   'subClassOf': [],\n",
       "   'predicates': [{'predId': 'https://brickschema.org/schema/1.1/Brick#hasLocation',\n",
       "     'label': 'https://brickschema.org/schema/1.1/Brick#hasLocation',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['https://w3id.org/platoon/WindFarm'],\n",
       "     'constraints': [],\n",
       "     'policy': None},\n",
       "    {'predId': 'https://w3id.org/platoon/hasStatusCode',\n",
       "     'label': 'https://w3id.org/platoon/hasStatusCode',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['https://w3id.org/platoon/StatusCodeProperty'],\n",
       "     'constraints': [],\n",
       "     'policy': None},\n",
       "    {'predId': 'http://www.w3.org/2000/01/rdf-schema#label',\n",
       "     'label': 'http://www.w3.org/2000/01/rdf-schema#label',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': [],\n",
       "     'constraints': [],\n",
       "     'policy': None},\n",
       "    {'predId': 'https://w3id.org/seas/isMemberOf',\n",
       "     'label': 'https://w3id.org/seas/isMemberOf',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['https://w3id.org/platoon/WindFarm'],\n",
       "     'constraints': [],\n",
       "     'policy': None}],\n",
       "   'datasources': ['engie_pilot1a'],\n",
       "   'predicate_sources': {'engie_pilot1a': ['https://brickschema.org/schema/1.1/Brick#hasLocation',\n",
       "     'https://w3id.org/platoon/hasStatusCode',\n",
       "     'http://www.w3.org/2000/01/rdf-schema#label',\n",
       "     'https://w3id.org/seas/isMemberOf']},\n",
       "   'predicate_RML_sources': {'https://brickschema.org/schema/1.1/Brick#hasLocation': [{'name': 'pilot1a_engie<|>windturbine_eventlogs',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_eventlogs',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}],\n",
       "    'https://w3id.org/seas/isMemberOf': [{'name': 'pilot1a_engie<|>windturbine_eventlogs',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_eventlogs',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}],\n",
       "    'https://w3id.org/platoon/hasStatusCode': [{'name': 'pilot1a_engie<|>windturbine_eventlogs',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_eventlogs',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}],\n",
       "    'http://www.w3.org/2000/01/rdf-schema#label': [{'name': 'pilot1a_engie<|>windturbine_eventlogs',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_eventlogs',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}]},\n",
       "   'instance_prefixes': [],\n",
       "   'constraints': [],\n",
       "   'policy': None,\n",
       "   'mappingIds': {}},\n",
       "  {'mtId': 'https://w3id.org/seas/StandardDeviationEvaluation',\n",
       "   'mttype': 'typed',\n",
       "   'label': 'https://w3id.org/seas/StandardDeviationEvaluation',\n",
       "   'desc': '',\n",
       "   'cardinality': -1,\n",
       "   'subClassOf': [],\n",
       "   'predicates': [{'predId': 'https://w3id.org/seas/evaluatedSimpleValue',\n",
       "     'label': 'https://w3id.org/seas/evaluatedSimpleValue',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['http://w3id.org/lindt/custom_datatypes#angle'],\n",
       "     'constraints': [],\n",
       "     'policy': None},\n",
       "    {'predId': 'https://w3id.org/seas/hasTemporalContext',\n",
       "     'label': 'https://w3id.org/seas/hasTemporalContext',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['http://www.w3.org/2006/time#Instant'],\n",
       "     'constraints': [],\n",
       "     'policy': None}],\n",
       "   'datasources': ['engie_pilot1a'],\n",
       "   'predicate_sources': {'engie_pilot1a': ['https://w3id.org/seas/evaluatedSimpleValue',\n",
       "     'https://w3id.org/seas/hasTemporalContext']},\n",
       "   'predicate_RML_sources': {'https://w3id.org/seas/hasTemporalContext': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}],\n",
       "    'https://w3id.org/seas/evaluatedSimpleValue': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}]},\n",
       "   'instance_prefixes': [],\n",
       "   'constraints': [],\n",
       "   'policy': None,\n",
       "   'mappingIds': {}},\n",
       "  {'mtId': 'https://w3id.org/seas/MinimumEvaluation',\n",
       "   'mttype': 'typed',\n",
       "   'label': 'https://w3id.org/seas/MinimumEvaluation',\n",
       "   'desc': '',\n",
       "   'cardinality': -1,\n",
       "   'subClassOf': [],\n",
       "   'predicates': [{'predId': 'https://w3id.org/seas/evaluatedSimpleValue',\n",
       "     'label': 'https://w3id.org/seas/evaluatedSimpleValue',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['http://w3id.org/lindt/custom_datatypes#angle'],\n",
       "     'constraints': [],\n",
       "     'policy': None},\n",
       "    {'predId': 'https://w3id.org/seas/hasTemporalContext',\n",
       "     'label': 'https://w3id.org/seas/hasTemporalContext',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['http://www.w3.org/2006/time#Instant'],\n",
       "     'constraints': [],\n",
       "     'policy': None}],\n",
       "   'datasources': ['engie_pilot1a'],\n",
       "   'predicate_sources': {'engie_pilot1a': ['https://w3id.org/seas/evaluatedSimpleValue',\n",
       "     'https://w3id.org/seas/hasTemporalContext']},\n",
       "   'predicate_RML_sources': {'https://w3id.org/seas/hasTemporalContext': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}],\n",
       "    'https://w3id.org/seas/evaluatedSimpleValue': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}]},\n",
       "   'instance_prefixes': [],\n",
       "   'constraints': [],\n",
       "   'policy': None,\n",
       "   'mappingIds': {}},\n",
       "  {'mtId': 'https://w3id.org/platoon/WindFarm',\n",
       "   'mttype': 'typed',\n",
       "   'label': 'https://w3id.org/platoon/WindFarm',\n",
       "   'desc': '',\n",
       "   'cardinality': -1,\n",
       "   'subClassOf': [],\n",
       "   'predicates': [{'predId': 'http://www.w3.org/2000/01/rdf-schema#label',\n",
       "     'label': 'http://www.w3.org/2000/01/rdf-schema#label',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': [],\n",
       "     'constraints': [],\n",
       "     'policy': None}],\n",
       "   'datasources': ['engie_pilot1a'],\n",
       "   'predicate_sources': {'engie_pilot1a': ['http://www.w3.org/2000/01/rdf-schema#label']},\n",
       "   'predicate_RML_sources': {'http://www.w3.org/2000/01/rdf-schema#label': [{'name': 'pilot1a_engie<|>windturbine_eventlogs',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_eventlogs',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}]},\n",
       "   'instance_prefixes': [],\n",
       "   'constraints': [],\n",
       "   'policy': None,\n",
       "   'mappingIds': {}},\n",
       "  {'mtId': 'https://w3id.org/platoon/PositionEvaluation',\n",
       "   'mttype': 'typed',\n",
       "   'label': 'https://w3id.org/platoon/PositionEvaluation',\n",
       "   'desc': '',\n",
       "   'cardinality': -1,\n",
       "   'subClassOf': [],\n",
       "   'predicates': [{'predId': 'https://w3id.org/seas/evaluatedSimpleValue',\n",
       "     'label': 'https://w3id.org/seas/evaluatedSimpleValue',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['http://w3id.org/lindt/custom_datatypes#angle'],\n",
       "     'constraints': [],\n",
       "     'policy': None},\n",
       "    {'predId': 'https://w3id.org/seas/hasTemporalContext',\n",
       "     'label': 'https://w3id.org/seas/hasTemporalContext',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['http://www.w3.org/2006/time#Instant'],\n",
       "     'constraints': [],\n",
       "     'policy': None}],\n",
       "   'datasources': ['engie_pilot1a'],\n",
       "   'predicate_sources': {'engie_pilot1a': ['https://w3id.org/seas/evaluatedSimpleValue',\n",
       "     'https://w3id.org/seas/hasTemporalContext']},\n",
       "   'predicate_RML_sources': {'https://w3id.org/seas/hasTemporalContext': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}],\n",
       "    'https://w3id.org/seas/evaluatedSimpleValue': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}]},\n",
       "   'instance_prefixes': [],\n",
       "   'constraints': [],\n",
       "   'policy': None,\n",
       "   'mappingIds': {}},\n",
       "  {'mtId': 'https://w3id.org/seas/MaximumEvaluation',\n",
       "   'mttype': 'typed',\n",
       "   'label': 'https://w3id.org/seas/MaximumEvaluation',\n",
       "   'desc': '',\n",
       "   'cardinality': -1,\n",
       "   'subClassOf': [],\n",
       "   'predicates': [{'predId': 'https://w3id.org/seas/evaluatedSimpleValue',\n",
       "     'label': 'https://w3id.org/seas/evaluatedSimpleValue',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['http://w3id.org/lindt/custom_datatypes#angle'],\n",
       "     'constraints': [],\n",
       "     'policy': None},\n",
       "    {'predId': 'https://w3id.org/seas/hasTemporalContext',\n",
       "     'label': 'https://w3id.org/seas/hasTemporalContext',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['http://www.w3.org/2006/time#Instant'],\n",
       "     'constraints': [],\n",
       "     'policy': None}],\n",
       "   'datasources': ['engie_pilot1a'],\n",
       "   'predicate_sources': {'engie_pilot1a': ['https://w3id.org/seas/evaluatedSimpleValue',\n",
       "     'https://w3id.org/seas/hasTemporalContext']},\n",
       "   'predicate_RML_sources': {'https://w3id.org/seas/hasTemporalContext': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}],\n",
       "    'https://w3id.org/seas/evaluatedSimpleValue': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}]},\n",
       "   'instance_prefixes': [],\n",
       "   'constraints': [],\n",
       "   'policy': None,\n",
       "   'mappingIds': {}},\n",
       "  {'mtId': 'https://w3id.org/seas/AverageEvaluation',\n",
       "   'mttype': 'typed',\n",
       "   'label': 'https://w3id.org/seas/AverageEvaluation',\n",
       "   'desc': '',\n",
       "   'cardinality': -1,\n",
       "   'subClassOf': [],\n",
       "   'predicates': [{'predId': 'https://w3id.org/seas/evaluatedSimpleValue',\n",
       "     'label': 'https://w3id.org/seas/evaluatedSimpleValue',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['http://w3id.org/lindt/custom_datatypes#angle'],\n",
       "     'constraints': [],\n",
       "     'policy': None},\n",
       "    {'predId': 'https://w3id.org/seas/hasTemporalContext',\n",
       "     'label': 'https://w3id.org/seas/hasTemporalContext',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['http://www.w3.org/2006/time#Instant'],\n",
       "     'constraints': [],\n",
       "     'policy': None}],\n",
       "   'datasources': ['engie_pilot1a'],\n",
       "   'predicate_sources': {'engie_pilot1a': ['https://w3id.org/seas/evaluatedSimpleValue',\n",
       "     'https://w3id.org/seas/hasTemporalContext']},\n",
       "   'predicate_RML_sources': {'https://w3id.org/seas/evaluatedSimpleValue': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}],\n",
       "    'https://w3id.org/seas/hasTemporalContext': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}]},\n",
       "   'instance_prefixes': [],\n",
       "   'constraints': [],\n",
       "   'policy': None,\n",
       "   'mappingIds': {}},\n",
       "  {'mtId': 'https://w3id.org/platoon/StatusCodeEvaluation',\n",
       "   'mttype': 'typed',\n",
       "   'label': 'https://w3id.org/platoon/StatusCodeEvaluation',\n",
       "   'desc': '',\n",
       "   'cardinality': -1,\n",
       "   'subClassOf': [],\n",
       "   'predicates': [{'predId': 'https://w3id.org/platoon/hasStatusCodePhase',\n",
       "     'label': 'https://w3id.org/platoon/hasStatusCodePhase',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': [],\n",
       "     'constraints': [],\n",
       "     'policy': None},\n",
       "    {'predId': 'https://w3id.org/platoon/hasStatusCodetype',\n",
       "     'label': 'https://w3id.org/platoon/hasStatusCodetype',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['http://www.w3.org/2001/XMLSchema#integer'],\n",
       "     'constraints': [],\n",
       "     'policy': None},\n",
       "    {'predId': 'https://w3id.org/platoon/hasRenewableEnergyProductionStatus',\n",
       "     'label': 'https://w3id.org/platoon/hasRenewableEnergyProductionStatus',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': [],\n",
       "     'constraints': [],\n",
       "     'policy': None},\n",
       "    {'predId': 'https://w3id.org/seas/hasTemporalContext',\n",
       "     'label': 'https://w3id.org/seas/hasTemporalContext',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['http://www.w3.org/2006/time#Instant'],\n",
       "     'constraints': [],\n",
       "     'policy': None}],\n",
       "   'datasources': ['engie_pilot1a'],\n",
       "   'predicate_sources': {'engie_pilot1a': ['https://w3id.org/platoon/hasStatusCodePhase',\n",
       "     'https://w3id.org/platoon/hasStatusCodetype',\n",
       "     'https://w3id.org/platoon/hasRenewableEnergyProductionStatus',\n",
       "     'https://w3id.org/seas/hasTemporalContext']},\n",
       "   'predicate_RML_sources': {'https://w3id.org/seas/hasTemporalContext': [{'name': 'pilot1a_engie<|>windturbine_eventlogs',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_eventlogs',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}],\n",
       "    'https://w3id.org/platoon/hasStatusCodetype': [{'name': 'pilot1a_engie<|>windturbine_eventlogs',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_eventlogs',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}],\n",
       "    'https://w3id.org/platoon/hasStatusCodePhase': [{'name': 'pilot1a_engie<|>windturbine_eventlogs',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_eventlogs',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}],\n",
       "    'https://w3id.org/platoon/hasRenewableEnergyProductionStatus': [{'name': 'pilot1a_engie<|>windturbine_eventlogs',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_eventlogs',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}]},\n",
       "   'instance_prefixes': [],\n",
       "   'constraints': [],\n",
       "   'policy': None,\n",
       "   'mappingIds': {}},\n",
       "  {'mtId': 'https://w3id.org/platoon/StatusCodeProperty',\n",
       "   'mttype': 'typed',\n",
       "   'label': 'https://w3id.org/platoon/StatusCodeProperty',\n",
       "   'desc': '',\n",
       "   'cardinality': -1,\n",
       "   'subClassOf': [],\n",
       "   'predicates': [{'predId': 'https://w3id.org/seas/evaluation',\n",
       "     'label': 'https://w3id.org/seas/evaluation',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['https://w3id.org/platoon/StatusCodeEvaluation'],\n",
       "     'constraints': [],\n",
       "     'policy': None},\n",
       "    {'predId': 'http://www.w3.org/2000/01/rdf-schema#label',\n",
       "     'label': 'http://www.w3.org/2000/01/rdf-schema#label',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': [],\n",
       "     'constraints': [],\n",
       "     'policy': None}],\n",
       "   'datasources': ['engie_pilot1a'],\n",
       "   'predicate_sources': {'engie_pilot1a': ['https://w3id.org/seas/evaluation',\n",
       "     'http://www.w3.org/2000/01/rdf-schema#label']},\n",
       "   'predicate_RML_sources': {'https://w3id.org/seas/evaluation': [{'name': 'pilot1a_engie<|>windturbine_eventlogs',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_eventlogs',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}],\n",
       "    'http://www.w3.org/2000/01/rdf-schema#label': [{'name': 'pilot1a_engie<|>windturbine_eventlogs',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_eventlogs',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}]},\n",
       "   'instance_prefixes': [],\n",
       "   'constraints': [],\n",
       "   'policy': None,\n",
       "   'mappingIds': {}},\n",
       "  {'mtId': 'https://w3id.org/platoon/Vane',\n",
       "   'mttype': 'typed',\n",
       "   'label': 'https://w3id.org/platoon/Vane',\n",
       "   'desc': '',\n",
       "   'cardinality': -1,\n",
       "   'subClassOf': [],\n",
       "   'predicates': [{'predId': 'https://w3id.org/platoon/hasAveragePosition',\n",
       "     'label': 'https://w3id.org/platoon/hasAveragePosition',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['https://w3id.org/platoon/PositionProperty'],\n",
       "     'constraints': [],\n",
       "     'policy': None},\n",
       "    {'predId': 'https://w3id.org/platoon/hasMinimumPosition',\n",
       "     'label': 'https://w3id.org/platoon/hasMinimumPosition',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['https://w3id.org/platoon/PositionProperty'],\n",
       "     'constraints': [],\n",
       "     'policy': None},\n",
       "    {'predId': 'https://w3id.org/seas/subSystemOf',\n",
       "     'label': 'https://w3id.org/seas/subSystemOf',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': [],\n",
       "     'constraints': [],\n",
       "     'policy': None},\n",
       "    {'predId': 'https://w3id.org/platoon/hasMaximumPosition',\n",
       "     'label': 'https://w3id.org/platoon/hasMaximumPosition',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['https://w3id.org/platoon/PositionProperty'],\n",
       "     'constraints': [],\n",
       "     'policy': None},\n",
       "    {'predId': 'https://w3id.org/platoon/hasStandardDeviationPosition',\n",
       "     'label': 'https://w3id.org/platoon/hasStandardDeviationPosition',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': ['https://w3id.org/platoon/PositionProperty'],\n",
       "     'constraints': [],\n",
       "     'policy': None},\n",
       "    {'predId': 'http://www.w3.org/2000/01/rdf-schema#label',\n",
       "     'label': 'http://www.w3.org/2000/01/rdf-schema#label',\n",
       "     'desc': '',\n",
       "     'cardinality': -1,\n",
       "     'prefix': '',\n",
       "     'ranges': [],\n",
       "     'constraints': [],\n",
       "     'policy': None}],\n",
       "   'datasources': ['engie_pilot1a'],\n",
       "   'predicate_sources': {'engie_pilot1a': ['https://w3id.org/platoon/hasAveragePosition',\n",
       "     'https://w3id.org/platoon/hasMinimumPosition',\n",
       "     'https://w3id.org/seas/subSystemOf',\n",
       "     'https://w3id.org/platoon/hasMaximumPosition',\n",
       "     'https://w3id.org/platoon/hasStandardDeviationPosition',\n",
       "     'http://www.w3.org/2000/01/rdf-schema#label']},\n",
       "   'predicate_RML_sources': {'https://w3id.org/platoon/hasMaximumPosition': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}],\n",
       "    'https://w3id.org/seas/subSystemOf': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}],\n",
       "    'https://w3id.org/platoon/hasStandardDeviationPosition': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}],\n",
       "    'https://w3id.org/platoon/hasMinimumPosition': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}],\n",
       "    'http://www.w3.org/2000/01/rdf-schema#label': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}],\n",
       "    'https://w3id.org/platoon/hasAveragePosition': [{'name': 'pilot1a_engie<|>windturbine_vane',\n",
       "      'dstype': 'MONGODB_LD_FLAT',\n",
       "      'ds_desc': {'jdbcdriver': '',\n",
       "       'collection_name': 'windturbine_vane',\n",
       "       'database_name': 'pilot1a_engie',\n",
       "       'dbms_version': '4.0.7'},\n",
       "      'dbmstype': 'MongoDB'}]},\n",
       "   'instance_prefixes': [],\n",
       "   'constraints': [],\n",
       "   'policy': None,\n",
       "   'mappingIds': {}}],\n",
       " 'sources': {'engie_pilot1a': {'dsId': 'engie_pilot1a',\n",
       "   'name': 'pilot1a_engie',\n",
       "   'desc': 'Pilot1A data on Wind turbines',\n",
       "   'url': '0.0.0.0:27017',\n",
       "   'dstype': 'MONGODB_LD_FLAT',\n",
       "   'params': {'<http://www.wiwiss.fu-berlin.de/suhl/bizer/D2RQ/0.1#jdbcDSN>': 'pilot1a_engie',\n",
       "    'username': 'root',\n",
       "    'password': '1234',\n",
       "    'windturbine_eventlogs': {'predicates': {'https://w3id.org/seas/hasTemporalContext': {'@id': 'hasTemporalContext',\n",
       "       '@type': '@id'},\n",
       "      'https://w3id.org/platoon/hasStatusCodetype': {'@id': 'hasStatusCode:type',\n",
       "       '@type': 'http://www.w3.org/2001/XMLSchema#integer'},\n",
       "      'https://w3id.org/platoon/hasStatusCodePhase': {'@id': 'hasStatusCodePhase'},\n",
       "      'https://w3id.org/platoon/hasRenewableEnergyProductionStatus': {'@id': 'hasRenewableEnergyProductionStatus',\n",
       "       '@type': '@id'},\n",
       "      'https://brickschema.org/schema/1.1/Brick#hasLocation': {'@id': 'hasLocation',\n",
       "       '@type': '@id'},\n",
       "      'https://w3id.org/seas/isMemberOf': {'@id': 'isMemberOf',\n",
       "       '@type': '@id'},\n",
       "      'https://w3id.org/platoon/hasStatusCode': {'@id': 'hasStatusCode',\n",
       "       '@type': '@id'},\n",
       "      'http://www.w3.org/2000/01/rdf-schema#label': {'@id': 'label'},\n",
       "      'http://www.w3.org/2006/time#inXSDDateTime': {'@id': 'inXSDDateTime',\n",
       "       '@type': 'http://www.w3.org/2001/XMLSchema#dateTime'},\n",
       "      'https://w3id.org/seas/evaluation': {'@id': 'evaluation',\n",
       "       '@type': '@id'}},\n",
       "     'prefixes': {'seas': 'https://w3id.org/seas/',\n",
       "      'cdt': 'http://w3id.org/lindt/custom_datatypes#',\n",
       "      'owl': 'http://www.w3.org/2002/07/owl#',\n",
       "      'saref': 'https://w3id.org/saref#',\n",
       "      'xsd': 'http://www.w3.org/2001/XMLSchema#',\n",
       "      'iter': 'http://w3id.org/sparql-generate/iter/',\n",
       "      'plt': 'https://w3id.org/platoon/',\n",
       "      'rdfs': 'http://www.w3.org/2000/01/rdf-schema#',\n",
       "      'time': 'http://www.w3.org/2006/time#',\n",
       "      'brick': 'https://brickschema.org/schema/1.1/Brick#',\n",
       "      'fun': 'http://w3id.org/sparql-generate/fn/',\n",
       "      'ssn': 'http://www.w3.org/ns/ssn/'}},\n",
       "    'windturbine_vane': {'predicates': {'https://w3id.org/seas/evaluation': {'@id': 'evaluation',\n",
       "       '@type': '@id'},\n",
       "      'http://www.w3.org/2000/01/rdf-schema#label': {'@id': 'label'},\n",
       "      'https://w3id.org/seas/evaluatedSimpleValue': {'@id': 'evaluatedSimpleValue',\n",
       "       '@type': 'http://w3id.org/lindt/custom_datatypes#angle'},\n",
       "      'https://w3id.org/seas/hasTemporalContext': {'@id': 'hasTemporalContext',\n",
       "       '@type': '@id'},\n",
       "      'http://www.w3.org/2006/time#inXSDDateTime': {'@id': 'inXSDDateTime',\n",
       "       '@type': 'http://www.w3.org/2001/XMLSchema#dateTime'},\n",
       "      'https://w3id.org/platoon/hasMaximumPosition': {'@id': 'hasMaximumPosition',\n",
       "       '@type': '@id'},\n",
       "      'https://w3id.org/seas/subSystemOf': {'@id': 'subSystemOf',\n",
       "       '@type': '@id'},\n",
       "      'https://w3id.org/platoon/hasStandardDeviationPosition': {'@id': 'hasStandardDeviationPosition',\n",
       "       '@type': '@id'},\n",
       "      'https://w3id.org/platoon/hasMinimumPosition': {'@id': 'hasMinimumPosition',\n",
       "       '@type': '@id'},\n",
       "      'https://w3id.org/platoon/hasAveragePosition': {'@id': 'hasAveragePosition',\n",
       "       '@type': '@id'}},\n",
       "     'prefixes': {'owl': 'http://www.w3.org/2002/07/owl#',\n",
       "      's4bldg': 'https://w3id.org/saref4bldg#',\n",
       "      'saref': 'https://w3id.org/saref#',\n",
       "      'xsd': 'http://www.w3.org/2001/XMLSchema#',\n",
       "      'iter': 'http://w3id.org/sparql-generate/iter/',\n",
       "      'rdfs': 'http://www.w3.org/2000/01/rdf-schema#',\n",
       "      'ssn': 'http://www.w3.org/ns/ssn/',\n",
       "      'seas': 'https://w3id.org/seas/',\n",
       "      'cdt': 'http://w3id.org/lindt/custom_datatypes#',\n",
       "      'dbr': 'http://dbpedia.org/resource/',\n",
       "      'plt': 'https://w3id.org/platoon/',\n",
       "      'pep': 'https://w3id.org/pep/',\n",
       "      'time': 'http://www.w3.org/2006/time#',\n",
       "      'brick': 'https://brickschema.org/schema/1.1/Brick#',\n",
       "      'prov': 'http://www.w3.org/ns/prov#',\n",
       "      'fun': 'http://w3id.org/sparql-generate/fn/'}}},\n",
       "   'acronym': 'ENGIE_Pilot1a_DS',\n",
       "   'labeling_property': 'http://www.w3.org/2000/01/rdf-schema#label',\n",
       "   'mappings': {},\n",
       "   'mapping_paths': [],\n",
       "   'mappings_type': None,\n",
       "   'typing_predicate': '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
       "   'policy': None}}}"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "fed.to_json()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "platoon_pilot1a_fed"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# FQP\n",
    "fqp = AwudimaFQP(fed)\n",
    "fqp.federation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "sparql_query = \"SELECT distinct * WHERE {?windfarm a <https://w3id.org/platoon/WindFarm>. \" \\\n",
    "                   \"?windfarm <http://www.w3.org/2000/01/rdf-schema#label> ?label. \" \\\n",
    "                   \"}\"\n",
    "resultset = fqp.execute(sparql_query, keep_in_memory=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "SELECT DISTINCT *\n",
       " WHERE {  { SERVICE <pilot1a_engie.windturbine_eventlogs:ds-engie_pilot1a@0.0.0.0:27017> { \n",
       "        ?windfarm <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <https://w3id.org/platoon/WindFarm> . \n",
       "        ?windfarm <http://www.w3.org/2000/01/rdf-schema#label> ?label }   \n",
       " }\n",
       "\n",
       "}"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "resultset.decomposition"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       " <awudima.operators.nonblocking.Xdistinct.Xdistinct object at 0x7fa900f5c150>\n",
       " {'label', 'windfarm'}\n",
       "   <awudima.operators.nonblocking.Xproject.Xproject object at 0x7fa8bad4b6d0>\n",
       "   {'label', 'windfarm'}\n",
       "     SERVICE <pilot1a_engie.windturbine_eventlogs:ds-engie_pilot1a@0.0.0.0:27017> { \n",
       "[{'$unwind': '$@graph'},\n",
       " {'$unwind': '$@graph.@type'},\n",
       " {'$match': {'$expr': {'$and': [{'$ne': ['$@graph.label', 'null']},\n",
       "                                {'$ne': ['$@graph.label', '']}]},\n",
       "             '@graph.@type': {'$in': ['plt:WindFarm']}}},\n",
       " {'$project': {'_id': 0, 'label': '$@graph.label', 'windfarm': '$@graph.@id'}}]\n",
       "     }"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "resultset.plan"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "resultset.retrieved_results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'head': {'vars': ['?windfarm', '?label']},\n",
       " 'results': {'bindings': [{'windfarm': {'type': 'uri',\n",
       "     'value': 'http://engie.com/platoon/resource/windfarm/frcve'},\n",
       "    'label': {'type': 'literal', 'value': 'FRCVE'}}]},\n",
       " 'message': 'All results are retrieved from resultset!',\n",
       " 'query': 'SELECT distinct * WHERE {?windfarm a <https://w3id.org/platoon/WindFarm>. ?windfarm <http://www.w3.org/2000/01/rdf-schema#label> ?label. }'}"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = resultset.results\n",
    "results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'windfarm': 'http://engie.com/platoon/resource/windfarm/frcve',\n",
       " 'label': 'FRCVE'}"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "{k:v['value']  for r in resultset.get() for k, v in r.items()}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>windfarm</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>{'type': 'uri', 'value': 'http://engie.com/pla...</td>\n",
       "      <td>{'type': 'literal', 'value': 'FRCVE'}</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            windfarm  \\\n",
       "0  {'type': 'uri', 'value': 'http://engie.com/pla...   \n",
       "\n",
       "                                   label  \n",
       "0  {'type': 'literal', 'value': 'FRCVE'}  "
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.DataFrame(results['results']['bindings'])\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "pilot1a_query1 = \"\"\"\n",
    "\n",
    "                prefix cim: <http://www.iec.ch/TC57/CIM#>\n",
    "                prefix plt: <https://w3id.org/platoon/>\n",
    "                prefix seas: <https://w3id.org/seas/> \n",
    "                prefix wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "                prefix qudt: <http://www.qudt.org/2.1/schema/qudt/>\n",
    "                prefix time: <http://www.w3.org/2006/time#>\n",
    "                SELECT Distinct *\n",
    "                WHERE{\n",
    "                    ?windfarm a  <https://w3id.org/platoon/WindFarm>.\n",
    "                    ?windfarm <http://www.w3.org/2000/01/rdf-schema#label> ?label.\n",
    "                    \n",
    "                }\n",
    "            \"\"\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "resultset = fqp.execute(pilot1a_query1, keep_in_memory=True)\n",
    "resultset.plan"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "pprint(resultset.results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "pilot1a_query2 = \"\"\"\n",
    "\n",
    "                prefix cim: <http://www.iec.ch/TC57/CIM#>\n",
    "                prefix plt: <https://w3id.org/platoon/>\n",
    "                prefix seas: <https://w3id.org/seas/> \n",
    "                prefix wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "                prefix qudt: <http://www.qudt.org/2.1/schema/qudt/>\n",
    "                prefix time: <http://www.w3.org/2006/time#>\n",
    "                SELECT Distinct *\n",
    "                WHERE{\n",
    "                    ?vane a  <https://w3id.org/platoon/Vane>.\n",
    "                    ?vane <http://www.w3.org/2000/01/rdf-schema#label> ?label.\n",
    "                    ?vane <https://w3id.org/platoon/hasStandardDeviationPosition> ?stdvPosition .\n",
    "                }\n",
    "            \"\"\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       " <awudima.operators.nonblocking.Xdistinct.Xdistinct object at 0x7fa8b976ca50>\n",
       " {'label', 'vane', 'stdvPosition'}\n",
       "   <awudima.operators.nonblocking.Xproject.Xproject object at 0x7fa8b97c7990>\n",
       "   {'label', 'vane', 'stdvPosition'}\n",
       "     SERVICE <pilot1a_engie.windturbine_vane:ds-engie_pilot1a@0.0.0.0:27017> { \n",
       "[{'$unwind': '$@graph'},\n",
       " {'$unwind': '$@graph.@type'},\n",
       " {'$match': {'$expr': {'$and': [{'$ne': ['$@graph.label', 'null']},\n",
       "                                {'$ne': ['$@graph.label', '']},\n",
       "                                {'$ne': ['$@graph.hasStandardDeviationPosition',\n",
       "                                         'null']},\n",
       "                                {'$ne': ['$@graph.hasStandardDeviationPosition',\n",
       "                                         '']}]},\n",
       "             '@graph.@type': {'$in': ['plt:Vane']}}},\n",
       " {'$project': {'_id': 0,\n",
       "               'label': '$@graph.label',\n",
       "               'stdvPosition': '$@graph.hasStandardDeviationPosition',\n",
       "               'vane': '$@graph.@id'}}]\n",
       "     }"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "resultset = fqp.execute(pilot1a_query2, keep_in_memory=True)\n",
    "resultset.plan"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'head': {'vars': ['?stdvPosition', '?vane', '?label']},\n",
       " 'results': {'bindings': [{'vane': {'type': 'uri',\n",
       "     'value': 'http://engie.com/platoon/resource/windfarm/frcve/windturbine/80499/vane'},\n",
       "    'label': {'type': 'literal', 'value': 'vane'},\n",
       "    'stdvPosition': {'type': 'uri',\n",
       "     'value': 'http://engie.com/platoon/resource/windfarm/frcve/windturbine/80499/vane/property/position/standarddeviation'}}]},\n",
       " 'message': 'All results are retrieved from resultset!',\n",
       " 'query': '\\n\\n                prefix cim: <http://www.iec.ch/TC57/CIM#>\\n                prefix plt: <https://w3id.org/platoon/>\\n                prefix seas: <https://w3id.org/seas/> \\n                prefix wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\\n                prefix qudt: <http://www.qudt.org/2.1/schema/qudt/>\\n                prefix time: <http://www.w3.org/2006/time#>\\n                SELECT Distinct *\\n                WHERE{\\n                    ?vane a  <https://w3id.org/platoon/Vane>.\\n                    ?vane <http://www.w3.org/2000/01/rdf-schema#label> ?label.\\n                    ?vane <https://w3id.org/platoon/hasStandardDeviationPosition> ?stdvPosition .\\n                }\\n            '}"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "resultset.results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "pilot1a_query3 = \"\"\"\n",
    "\n",
    "                prefix cim: <http://www.iec.ch/TC57/CIM#>\n",
    "                prefix plt: <https://w3id.org/platoon/>\n",
    "                prefix seas: <https://w3id.org/seas/> \n",
    "                prefix wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "                prefix qudt: <http://www.qudt.org/2.1/schema/qudt/>\n",
    "                prefix time: <http://www.w3.org/2006/time#>\n",
    "                SELECT Distinct *\n",
    "                WHERE{\n",
    "                    ?vane a  <https://w3id.org/platoon/Vane>.\n",
    "                    ?vane <http://www.w3.org/2000/01/rdf-schema#label> ?label.\n",
    "                    ?vane <https://w3id.org/platoon/hasStandardDeviationPosition> ?stdvPosition .\n",
    "                    ?vane <https://w3id.org/seas/subSystemOf> ?subSystemOf .\n",
    "                    ?vane <https://w3id.org/platoon/hasAveragePosition> ?avgPosition .\n",
    "                    ?vane <https://w3id.org/platoon/hasMaximumPosition> ?maxPosition .\n",
    "                    ?vane <https://w3id.org/platoon/hasMinimumPosition> ?minPosition .\n",
    "                    ?maxPosition <http://www.w3.org/2000/01/rdf-schema#label> ?poslabel.\n",
    "                    ?maxPosition seas:evaluation ?positionEval.\n",
    "                }\n",
    "            \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       " <awudima.operators.nonblocking.Xdistinct.Xdistinct object at 0x7fa8b97c7510>\n",
       " {'label', 'positionEval', 'maxPosition', 'avgPosition', 'vane', 'subSystemOf', 'poslabel', 'stdvPosition', 'minPosition'}\n",
       "   <awudima.operators.nonblocking.Xproject.Xproject object at 0x7fa8b98adc50>\n",
       "   {'label', 'positionEval', 'maxPosition', 'avgPosition', 'vane', 'subSystemOf', 'poslabel', 'stdvPosition', 'minPosition'}\n",
       "     <awudima.operators.nonblocking.Xgjoin.Xgjoin object at 0x7fa8b976c090>\n",
       "     {'label', 'positionEval', 'maxPosition', 'avgPosition', 'vane', 'subSystemOf', 'poslabel', 'stdvPosition', 'minPosition'}\n",
       "       SERVICE <pilot1a_engie.windturbine_vane:ds-engie_pilot1a@0.0.0.0:27017> { \n",
       "[{'$unwind': '$@graph'},\n",
       " {'$unwind': '$@graph.@type'},\n",
       " {'$match': {'$expr': {'$and': [{'$ne': ['$@graph.label', 'null']},\n",
       "                                {'$ne': ['$@graph.label', '']},\n",
       "                                {'$ne': ['$@graph.hasStandardDeviationPosition',\n",
       "                                         'null']},\n",
       "                                {'$ne': ['$@graph.hasStandardDeviationPosition',\n",
       "                                         '']},\n",
       "                                {'$ne': ['$@graph.subSystemOf', 'null']},\n",
       "                                {'$ne': ['$@graph.subSystemOf', '']},\n",
       "                                {'$ne': ['$@graph.hasAveragePosition', 'null']},\n",
       "                                {'$ne': ['$@graph.hasAveragePosition', '']},\n",
       "                                {'$ne': ['$@graph.hasMaximumPosition', 'null']},\n",
       "                                {'$ne': ['$@graph.hasMaximumPosition', '']},\n",
       "                                {'$ne': ['$@graph.hasMinimumPosition', 'null']},\n",
       "                                {'$ne': ['$@graph.hasMinimumPosition', '']}]},\n",
       "             '@graph.@type': {'$in': ['plt:Vane']}}},\n",
       " {'$project': {'_id': 0,\n",
       "               'avgPosition': '$@graph.hasAveragePosition',\n",
       "               'label': '$@graph.label',\n",
       "               'maxPosition': '$@graph.hasMaximumPosition',\n",
       "               'minPosition': '$@graph.hasMinimumPosition',\n",
       "               'stdvPosition': '$@graph.hasStandardDeviationPosition',\n",
       "               'subSystemOf': '$@graph.subSystemOf',\n",
       "               'vane': '$@graph.@id'}}]\n",
       "       }       SERVICE <pilot1a_engie.windturbine_vane:ds-engie_pilot1a@0.0.0.0:27017> { \n",
       "[{'$unwind': '$@graph'},\n",
       " {'$unwind': '$@graph.@type'},\n",
       " {'$match': {'$expr': {'$and': [{'$ne': ['$@graph.label', 'null']},\n",
       "                                {'$ne': ['$@graph.label', '']},\n",
       "                                {'$ne': ['$@graph.evaluation', 'null']},\n",
       "                                {'$ne': ['$@graph.evaluation', '']}]},\n",
       "             '@graph.@type': {'$in': ['plt:PositionProperty']}}},\n",
       " {'$project': {'_id': 0,\n",
       "               'maxPosition': '$@graph.@id',\n",
       "               'positionEval': '$@graph.evaluation',\n",
       "               'poslabel': '$@graph.label'}}]\n",
       "       }"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "resultset = fqp.execute(pilot1a_query3, keep_in_memory=True)\n",
    "resultset.plan"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'head': {'vars': ['?subSystemOf',\n",
       "   '?poslabel',\n",
       "   '?vane',\n",
       "   '?positionEval',\n",
       "   '?label',\n",
       "   '?maxPosition',\n",
       "   '?avgPosition',\n",
       "   '?minPosition',\n",
       "   '?stdvPosition']},\n",
       " 'results': {'bindings': [{'maxPosition': {'type': 'uri',\n",
       "     'value': 'http://engie.com/platoon/resource/windfarm/frcve/windturbine/80499/vane/property/position/maximum'},\n",
       "    'poslabel': {'type': 'literal', 'value': 'vane position_1_2  maximum'},\n",
       "    'positionEval': {'type': 'uri',\n",
       "     'value': 'http://engie.com/platoon/resource/windfarm/frcve/windturbine/80499/vane/property/position/maximum/evaluation/2019-01-05t00:00:00z'},\n",
       "    'vane': {'type': 'uri',\n",
       "     'value': 'http://engie.com/platoon/resource/windfarm/frcve/windturbine/80499/vane'},\n",
       "    'label': {'type': 'literal', 'value': 'vane'},\n",
       "    'stdvPosition': {'type': 'uri',\n",
       "     'value': 'http://engie.com/platoon/resource/windfarm/frcve/windturbine/80499/vane/property/position/standarddeviation'},\n",
       "    'subSystemOf': {'type': 'uri',\n",
       "     'value': 'http://engie.com/platoon/resource/windfarm/frcve/windturbine/80499'},\n",
       "    'avgPosition': {'type': 'uri',\n",
       "     'value': 'http://engie.com/platoon/resource/windfarm/frcve/windturbine/80499/vane/property/position/average'},\n",
       "    'minPosition': {'type': 'uri',\n",
       "     'value': 'http://engie.com/platoon/resource/windfarm/frcve/windturbine/80499/vane/property/position/minimum'}}]},\n",
       " 'message': 'All results are retrieved from resultset!',\n",
       " 'query': '\\n\\n                prefix cim: <http://www.iec.ch/TC57/CIM#>\\n                prefix plt: <https://w3id.org/platoon/>\\n                prefix seas: <https://w3id.org/seas/> \\n                prefix wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\\n                prefix qudt: <http://www.qudt.org/2.1/schema/qudt/>\\n                prefix time: <http://www.w3.org/2006/time#>\\n                SELECT Distinct *\\n                WHERE{\\n                    ?vane a  <https://w3id.org/platoon/Vane>.\\n                    ?vane <http://www.w3.org/2000/01/rdf-schema#label> ?label.\\n                    ?vane <https://w3id.org/platoon/hasStandardDeviationPosition> ?stdvPosition .\\n                    ?vane <https://w3id.org/seas/subSystemOf> ?subSystemOf .\\n                    ?vane <https://w3id.org/platoon/hasAveragePosition> ?avgPosition .\\n                    ?vane <https://w3id.org/platoon/hasMaximumPosition> ?maxPosition .\\n                    ?vane <https://w3id.org/platoon/hasMinimumPosition> ?minPosition .\\n                    ?maxPosition <http://www.w3.org/2000/01/rdf-schema#label> ?poslabel.\\n                    ?maxPosition seas:evaluation ?positionEval.\\n                }\\n            '}"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "resultset.results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "resultset.retrieved_results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "  prefix cim: <http://www.iec.ch/TC57/CIM#>\n",
    "                prefix plt: <https://w3id.org/platoon/>\n",
    "                prefix seas: <https://w3id.org/seas/> \n",
    "                prefix wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "                prefix qudt: <http://www.qudt.org/2.1/schema/qudt/>\n",
    "                prefix time: <http://www.w3.org/2006/time#>\n",
    "                SELECT Distinct *\n",
    "                WHERE {     \n",
    "                    \n",
    "                    ?context time:inXSDDateTime ?time .\n",
    "                }\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       " <awudima.operators.nonblocking.Xdistinct.Xdistinct object at 0x7fa8b98c2550>\n",
       " {'context', 'time'}\n",
       "   <awudima.operators.nonblocking.Xproject.Xproject object at 0x7fa8b98c7350>\n",
       "   {'context', 'time'}\n",
       "     SERVICE <pilot1a_engie.windturbine_vane:ds-engie_pilot1a@0.0.0.0:27017> { \n",
       "[{'$unwind': '$@graph'},\n",
       " {'$unwind': '$@graph.@type'},\n",
       " {'$match': {'$expr': {'$and': [{'$ne': ['$@graph.inXSDDateTime', 'null']},\n",
       "                                {'$ne': ['$@graph.inXSDDateTime', '']}]},\n",
       "             '@graph.@type': {'$in': ['time:Instant']}}},\n",
       " {'$unionWith': {'coll': 'windturbine_eventlogs',\n",
       "                 'pipeline': [{'$unwind': '$@graph'},\n",
       "                              {'$unwind': '$@graph.@type'},\n",
       "                              {'$match': {'$expr': {'$and': [{'$ne': ['$@graph.inXSDDateTime',\n",
       "                                                                      'null']},\n",
       "                                                             {'$ne': ['$@graph.inXSDDateTime',\n",
       "                                                                      '']}]},\n",
       "                                          '@graph.@type': {'$in': ['time:Instant']}}},\n",
       "                              {'$project': {'_id': 0,\n",
       "                                            'time': '$@graph.inXSDDateTime'}}]}},\n",
       " {'$project': {'_id': 0,\n",
       "               'context': '$@graph.@id',\n",
       "               'time': '$@graph.inXSDDateTime'}}]\n",
       "     }"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "resultset = fqp.execute(query, keep_in_memory=True)\n",
    "resultset.plan"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\n",
       "prefix cim: <http://www.iec.ch/TC57/CIM#>\n",
       "prefix plt: <https://w3id.org/platoon/>\n",
       "prefix seas: <https://w3id.org/seas/>\n",
       "prefix wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
       "prefix qudt: <http://www.qudt.org/2.1/schema/qudt/>\n",
       "prefix time: <http://www.w3.org/2006/time#>\n",
       "SELECT DISTINCT *\n",
       " WHERE {  { SERVICE <pilot1a_engie.windturbine_vane:ds-engie_pilot1a@0.0.0.0:27017> { \n",
       "        ?context time:inXSDDateTime ?time }   \n",
       " }\n",
       "\n",
       "}"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "resultset.decomposition"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'head': {'vars': ['?context', '?time']},\n",
       " 'results': {'bindings': [{'context': {'type': 'uri',\n",
       "     'value': 'http://engie.com/platoon/resource/windfarm/frcve/windturbine/80499/timestamp/2019-01-05t00:00:00z'},\n",
       "    'time': {'type': 'literal',\n",
       "     'value': '2019-01-05T00:00:00Z',\n",
       "     'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime'}}]},\n",
       " 'message': 'All results are retrieved from resultset!',\n",
       " 'query': '\\n  prefix cim: <http://www.iec.ch/TC57/CIM#>\\n                prefix plt: <https://w3id.org/platoon/>\\n                prefix seas: <https://w3id.org/seas/> \\n                prefix wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\\n                prefix qudt: <http://www.qudt.org/2.1/schema/qudt/>\\n                prefix time: <http://www.w3.org/2006/time#>\\n                SELECT Distinct *\\n                WHERE {\\n                    \\n                    ?context time:inXSDDateTime ?time .\\n                }\\n'}"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "resultset.results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'fedId': 'platoon_pilot3a_fed',\n",
       " 'name': 'PLATOON Pilot3a Federation',\n",
       " 'desc': 'Federation of platoon datasets',\n",
       " 'rdfmts': [],\n",
       " 'sources': {'engie_pilot3a': {'dsId': 'engie_pilot3a',\n",
       "   'name': 'pilot3a_engie',\n",
       "   'desc': 'Pilot3A data on Wind turbines',\n",
       "   'url': '0.0.0.0:27017',\n",
       "   'dstype': 'MONGODB_LD_FLAT',\n",
       "   'params': {'<http://www.wiwiss.fu-berlin.de/suhl/bizer/D2RQ/0.1#jdbcDSN>': 'pilot3a_engie',\n",
       "    'username': 'root',\n",
       "    'password': '1234'},\n",
       "   'acronym': 'ENGIE_Pilot3a_DS',\n",
       "   'labeling_property': 'http://www.w3.org/2000/01/rdf-schema#label',\n",
       "   'mappings': {},\n",
       "   'mapping_paths': [],\n",
       "   'mappings_type': None,\n",
       "   'typing_predicate': '<http://www.w3.org/1999/02/22-rdf-syntax-ns#type>',\n",
       "   'policy': None}}}"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "fed2 = Federation(\"platoon_pilot3a_fed\", \"PLATOON Pilot3a Federation\", \"Federation of platoon datasets\")\n",
    "ds1 = DataSource(\"pilot3a_engie\",  # name of the database\n",
    "                 'engie_pilot3a',  # Id of the data source\n",
    "                 '0.0.0.0:27017',  # URL of the data source\n",
    "                 DataSourceType.MONGODB_LD_FLAT,  # type of the data source\n",
    "                 desc=\"Pilot3A data on Wind turbines\",\n",
    "                 params={\n",
    "                     \"<http://www.wiwiss.fu-berlin.de/suhl/bizer/D2RQ/0.1#jdbcDSN>\": \"pilot3a_engie\",\n",
    "                     'username': 'root',\n",
    "                     'password': '1234'\n",
    "                 },\n",
    "                 acronym='ENGIE_Pilot3a_DS')\n",
    "ds1.to_json()\n",
    "fed2.addSource(ds1)\n",
    "fed2.to_json()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0.0.0.0:27017\n",
      "----------------------\n",
      "total mts: 22\n",
      "1 ) extracting description for  0.0.0.0:27017 is done!\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{http://www.w3.org/2006/time#Instant,\n",
       " http://www.w3.org/ns/prov#Activity,\n",
       " https://w3id.org/bot#Building,\n",
       " https://w3id.org/bot#Zone,\n",
       " https://w3id.org/pep/ProcedureExecution,\n",
       " https://w3id.org/platoon/AirTemperatureEvaluation,\n",
       " https://w3id.org/platoon/CloudOpacityEvaluation,\n",
       " https://w3id.org/platoon/CloudOpacityProperty,\n",
       " https://w3id.org/platoon/DiffuseSolarRadiationEvaluation,\n",
       " https://w3id.org/platoon/DiffuseSolarRadiationProperty,\n",
       " https://w3id.org/platoon/DirectSolarRadiationEvaluation,\n",
       " https://w3id.org/platoon/DirectSolarRadiationProperty,\n",
       " https://w3id.org/platoon/ElectricityEnergyConsumptionEvaluation,\n",
       " https://w3id.org/platoon/HeatingGasEnergyConsumptionEvaluation,\n",
       " https://w3id.org/platoon/OccupiedNumberEvaluation,\n",
       " https://w3id.org/platoon/OpeningPercentageEvaluation,\n",
       " https://w3id.org/platoon/SolarRadiationEvaluation,\n",
       " https://w3id.org/platoon/SolarRadiationProperty,\n",
       " https://w3id.org/saref#Occupancy}"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "fed2.extract_molecules()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "platoon_pilot3a_fed"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# FQP\n",
    "fqp = AwudimaFQP(fed2)\n",
    "fqp.federation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'head': {'vars': ['?irradiance', '?zone', '?cop', '?building']},\n",
       " 'results': {'bindings': [{'building': {'type': 'uri',\n",
       "     'value': 'http://engie.com/platoon/resource/building/crigen-stains'},\n",
       "    'cop': {'type': 'uri',\n",
       "     'value': 'http://engie.com/platoon/resource/building/crigen-stains/property/cloudopacity'},\n",
       "    'irradiance': {'type': 'uri',\n",
       "     'value': 'http://engie.com/platoon/resource/building/crigen-stains/property/directnormalirradiance'},\n",
       "    'zone': {'type': 'uri', 'value': ''}}]},\n",
       " 'message': 'All results are retrieved from resultset!',\n",
       " 'query': '\\n    prefix cim: <http://www.iec.ch/TC57/CIM#>\\n    prefix plt: <https://w3id.org/platoon/>\\n    prefix seas: <https://w3id.org/seas/> \\n    prefix wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\\n    prefix qudt: <http://www.qudt.org/2.1/schema/qudt/>\\n    prefix time: <http://www.w3.org/2006/time#>\\n    SELECT Distinct *\\n    WHERE{\\n        ?building <https://w3id.org/platoon/hasCloudOpacity> ?cop .   \\n        ?building <https://w3id.org/bot#containsZone> ?zone .\\n        ?building <https://w3id.org/platoon/hasDirectNormalIrradiance> ?irradiance         \\n    }\\n'}"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "pilot3a_query1 = \"\"\"\n",
    "    prefix cim: <http://www.iec.ch/TC57/CIM#>\n",
    "    prefix plt: <https://w3id.org/platoon/>\n",
    "    prefix seas: <https://w3id.org/seas/> \n",
    "    prefix wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "    prefix qudt: <http://www.qudt.org/2.1/schema/qudt/>\n",
    "    prefix time: <http://www.w3.org/2006/time#>\n",
    "    SELECT Distinct *\n",
    "    WHERE{\n",
    "        ?building <https://w3id.org/platoon/hasCloudOpacity> ?cop .   \n",
    "        ?building <https://w3id.org/bot#containsZone> ?zone .\n",
    "        ?building <https://w3id.org/platoon/hasDirectNormalIrradiance> ?irradiance         \n",
    "    }\n",
    "\"\"\"\n",
    "rs = fqp.execute(pilot3a_query1, keep_in_memory=True)\n",
    "rs.results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       " <awudima.operators.nonblocking.Xdistinct.Xdistinct object at 0x7fa8b992b190>\n",
       " {'building', 'cop', 'zone', 'irradiance'}\n",
       "   <awudima.operators.nonblocking.Xproject.Xproject object at 0x7fa8b9704210>\n",
       "   {'building', 'cop', 'zone', 'irradiance'}\n",
       "     SERVICE <pilot3a_engie.weather-estimated-actuals:ds-engie_pilot3a@0.0.0.0:27017> { \n",
       "[{'$unwind': '$@graph'},\n",
       " {'$unwind': '$@graph.@type'},\n",
       " {'$match': {'$expr': {'$and': [{'$ne': ['$@graph.hasCloudOpacity', 'null']},\n",
       "                                {'$ne': ['$@graph.hasCloudOpacity', '']},\n",
       "                                {'$ne': ['$@graph.hasDirectNormalIrradiance',\n",
       "                                         'null']},\n",
       "                                {'$ne': ['$@graph.hasDirectNormalIrradiance',\n",
       "                                         '']}]},\n",
       "             '@graph.@type': {'$in': ['bot:Building']}}},\n",
       " {'$unionWith': {'coll': 'occupancy',\n",
       "                 'pipeline': [{'$unwind': '$@graph'},\n",
       "                              {'$unwind': '$@graph.@type'},\n",
       "                              {'$match': {'$expr': {'$and': [{'$ne': ['$@graph.containsZone',\n",
       "                                                                      'null']},\n",
       "                                                             {'$ne': ['$@graph.containsZone',\n",
       "                                                                      '']}]},\n",
       "                                          '@graph.@type': {'$in': ['bot:Building']}}},\n",
       "                              {'$project': {'_id': 0,\n",
       "                                            'zone': '$@graph.containsZone'}}]}},\n",
       " {'$project': {'_id': 0,\n",
       "               'building': '$@graph.@id',\n",
       "               'cop': '$@graph.hasCloudOpacity',\n",
       "               'irradiance': '$@graph.hasDirectNormalIrradiance'}}]\n",
       "     }"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "rs.plan"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       " <awudima.operators.nonblocking.Xdistinct.Xdistinct object at 0x7fa8b99571d0>\n",
       " {'tcontext', 'value', 'cop', 'eval', 'inxsdtime'}\n",
       "   <awudima.operators.nonblocking.Xproject.Xproject object at 0x7fa8b9764ed0>\n",
       "   {'tcontext', 'value', 'cop', 'eval', 'inxsdtime'}\n",
       "     <awudima.operators.nonblocking.Xgjoin.Xgjoin object at 0x7fa8b98b9c90>\n",
       "     {'tcontext', 'value', 'cop', 'eval', 'inxsdtime'}\n",
       "       SERVICE <pilot3a_engie.bms-controller:ds-engie_pilot3a@0.0.0.0:27017> { \n",
       "[{'$unwind': '$@graph'},\n",
       " {'$unwind': '$@graph.@type'},\n",
       " {'$match': {'$expr': {'$and': [{'$ne': ['$@graph.evaluationOf', 'null']},\n",
       "                                {'$ne': ['$@graph.evaluationOf', '']},\n",
       "                                {'$ne': ['$@graph.evaluatedSimpleValue',\n",
       "                                         'null']},\n",
       "                                {'$ne': ['$@graph.evaluatedSimpleValue', '']},\n",
       "                                {'$ne': ['$@graph.hasTemporalContext', 'null']},\n",
       "                                {'$ne': ['$@graph.hasTemporalContext', '']}]},\n",
       "             '@graph.@type': {'$in': ['plt:AirTemperatureEvaluation']}}},\n",
       " {'$project': {'_id': 0,\n",
       "               'cop': '$@graph.evaluationOf',\n",
       "               'eval': '$@graph.@id',\n",
       "               'tcontext': '$@graph.hasTemporalContext',\n",
       "               'value': '$@graph.evaluatedSimpleValue'}},\n",
       " {'$unionWith': {'coll': 'bms-meter',\n",
       "                 'pipeline': [{'$unwind': '$@graph'},\n",
       "                              {'$unwind': '$@graph.@type'},\n",
       "                              {'$match': {'$expr': {'$and': [{'$ne': ['$@graph.evaluationOf',\n",
       "                                                                      'null']},\n",
       "                                                             {'$ne': ['$@graph.evaluationOf',\n",
       "                                                                      '']},\n",
       "                                                             {'$ne': ['$@graph.evaluatedSimpleValue',\n",
       "                                                                      'null']},\n",
       "                                                             {'$ne': ['$@graph.evaluatedSimpleValue',\n",
       "                                                                      '']},\n",
       "                                                             {'$ne': ['$@graph.hasTemporalContext',\n",
       "                                                                      'null']},\n",
       "                                                             {'$ne': ['$@graph.hasTemporalContext',\n",
       "                                                                      '']}]},\n",
       "                                          '@graph.@type': {'$in': ['plt:ElectricityEnergyConsumptionEvaluation']}}},\n",
       "                              {'$project': {'_id': 0,\n",
       "                                            'cop': '$@graph.evaluationOf',\n",
       "                                            'eval': '$@graph.@id',\n",
       "                                            'tcontext': '$@graph.hasTemporalContext',\n",
       "                                            'value': '$@graph.evaluatedSimpleValue'}}]}}]\n",
       "       }       SERVICE <pilot3a_engie.bms-controller:ds-engie_pilot3a@0.0.0.0:27017> { \n",
       "[{'$unwind': '$@graph'},\n",
       " {'$unwind': '$@graph.@type'},\n",
       " {'$match': {'$expr': {'$and': [{'$ne': ['$@graph.inXSDDateTime', 'null']},\n",
       "                                {'$ne': ['$@graph.inXSDDateTime', '']}]},\n",
       "             '@graph.@type': {'$in': ['time:Instant']}}},\n",
       " {'$unionWith': {'coll': 'occupancy',\n",
       "                 'pipeline': [{'$unwind': '$@graph'},\n",
       "                              {'$unwind': '$@graph.@type'},\n",
       "                              {'$match': {'$expr': {'$and': [{'$ne': ['$@graph.inXSDDateTime',\n",
       "                                                                      'null']},\n",
       "                                                             {'$ne': ['$@graph.inXSDDateTime',\n",
       "                                                                      '']}]},\n",
       "                                          '@graph.@type': {'$in': ['time:Instant']}}},\n",
       "                              {'$project': {'_id': 0,\n",
       "                                            'inxsdtime': '$@graph.inXSDDateTime'}}]}},\n",
       " {'$unionWith': {'coll': 'bms-meter',\n",
       "                 'pipeline': [{'$unwind': '$@graph'},\n",
       "                              {'$unwind': '$@graph.@type'},\n",
       "                              {'$match': {'$expr': {'$and': [{'$ne': ['$@graph.inXSDDateTime',\n",
       "                                                                      'null']},\n",
       "                                                             {'$ne': ['$@graph.inXSDDateTime',\n",
       "                                                                      '']}]},\n",
       "                                          '@graph.@type': {'$in': ['time:Instant']}}},\n",
       "                              {'$project': {'_id': 0,\n",
       "                                            'inxsdtime': '$@graph.inXSDDateTime'}}]}},\n",
       " {'$project': {'_id': 0,\n",
       "               'inxsdtime': '$@graph.inXSDDateTime',\n",
       "               'tcontext': '$@graph.@id'}}]\n",
       "       }"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pilot3a_query2 = \"\"\"\n",
    "            prefix cim: <http://www.iec.ch/TC57/CIM#>\n",
    "            prefix plt: <https://w3id.org/platoon/>\n",
    "            prefix seas: <https://w3id.org/seas/> \n",
    "            prefix wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "            prefix qudt: <http://www.qudt.org/2.1/schema/qudt/>\n",
    "            prefix time: <http://www.w3.org/2006/time#>\n",
    "            SELECT Distinct *\n",
    "            WHERE{                \n",
    "                ?eval seas:evaluationOf ?cop .\n",
    "                ?eval <https://w3id.org/seas/evaluatedSimpleValue> ?value.      \n",
    "                ?eval <https://w3id.org/seas/hasTemporalContext> ?tcontext.      \n",
    "                ?tcontext <http://www.w3.org/2006/time#inXSDDateTime> ?inxsdtime.    \n",
    "            }\n",
    "        \"\"\"\n",
    "rs = fqp.execute(pilot3a_query2, keep_in_memory=True)\n",
    "rs.plan"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    " pilot3a_query2 = \"\"\"\n",
    "            prefix cim: <http://www.iec.ch/TC57/CIM#>\n",
    "            prefix plt: <https://w3id.org/platoon/>\n",
    "            prefix seas: <https://w3id.org/seas/> \n",
    "            prefix wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "            prefix qudt: <http://www.qudt.org/2.1/schema/qudt/>\n",
    "            prefix time: <http://www.w3.org/2006/time#>\n",
    "            SELECT Distinct *\n",
    "            WHERE{                \n",
    "                ?eval seas:evaluationOf ?cop .\n",
    "                ?eval <https://w3id.org/seas/evaluatedSimpleValue> ?value.      \n",
    "                ?eval <https://w3id.org/seas/hasTemporalContext> ?tcontext.      \n",
    "                ?tcontext <http://www.w3.org/2006/time#inXSDDateTime> ?inxsdtime.    \n",
    "            }\n",
    "        \"\"\"\n",
    "    pilot3a_query3 = \"\"\"\n",
    "            prefix cim: <http://www.iec.ch/TC57/CIM#>\n",
    "            prefix plt: <https://w3id.org/platoon/>\n",
    "            prefix seas: <https://w3id.org/seas/> \n",
    "            prefix wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "            prefix qudt: <http://www.qudt.org/2.1/schema/qudt/>\n",
    "            prefix time: <http://www.w3.org/2006/time#>\n",
    "            SELECT Distinct *\n",
    "            WHERE{\n",
    "                ?building <https://w3id.org/platoon/hasGlobalHorizontalIrradiance> ?prop .\n",
    "                ?prop a <https://w3id.org/platoon/SolarRadiationProperty> .\n",
    "                ?prop <https://w3id.org/seas/evaluation> ?eval.\n",
    "                ?eval a plt:SolarRadiationEvaluation.\n",
    "                ?eval <https://w3id.org/seas/evaluatedSimpleValue> ?value.\n",
    "                ?eval <http://www.w3.org/2006/time#duration> ?duration.\n",
    "            }\n",
    "        \"\"\"\n",
    "    pilot3a_query4 = \"\"\"\n",
    "    \n",
    "        prefix cim: <http://www.iec.ch/TC57/CIM#>\n",
    "            prefix plt: <https://w3id.org/platoon/>\n",
    "            prefix seas: <https://w3id.org/seas/> \n",
    "            prefix wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "            prefix qudt: <http://www.qudt.org/2.1/schema/qudt/>\n",
    "            prefix time: <http://www.w3.org/2006/time#>\n",
    "            SELECT Distinct *\n",
    "            WHERE{\n",
    "                ?building <https://w3id.org/platoon/hasCloudOpacity> ?cop .\n",
    "                ?building <https://w3id.org/platoon/hasDirectNormalIrradiance> ?directNormalIrradiance.\n",
    "                ?building <https://w3id.org/bot#containsZone> ?zone.\n",
    "                ?building <http://www.w3.org/2000/01/rdf-schema#label> ?label.\n",
    "                ?building <https://w3id.org/platoon/hasGlobalHorizontalIrradiance> ?globalHorIrradiance.\n",
    "                ?building <https://w3id.org/platoon/hasDirectHorizontalIrradiance> ?directHorIrradiance.\n",
    "                ?building <https://w3id.org/platoon/hasDiffuseHorizontalIrradiance> ?diffHorIrradiance.\n",
    "            }\n",
    "    \"\"\"\n",
    "    pilot3a_query5 = \"\"\"\n",
    "\n",
    "            prefix cim: <http://www.iec.ch/TC57/CIM#>\n",
    "                prefix plt: <https://w3id.org/platoon/>\n",
    "                prefix seas: <https://w3id.org/seas/> \n",
    "                prefix wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "                prefix qudt: <http://www.qudt.org/2.1/schema/qudt/>\n",
    "                prefix time: <http://www.w3.org/2006/time#>\n",
    "                SELECT Distinct *\n",
    "                WHERE{\n",
    "                    ?building <https://w3id.org/bot#containsZone> ?zone.\n",
    "                    ?building <http://www.w3.org/2000/01/rdf-schema#label> ?label.\n",
    "                }\n",
    "        \"\"\"\n",
    "    pilot3a_query6 = \"\"\"\n",
    "                prefix cim: <http://www.iec.ch/TC57/CIM#>\n",
    "                prefix plt: <https://w3id.org/platoon/>\n",
    "                prefix seas: <https://w3id.org/seas/> \n",
    "                prefix wgs84_pos: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "                prefix qudt: <http://www.qudt.org/2.1/schema/qudt/>\n",
    "                prefix time: <http://www.w3.org/2006/time#>\n",
    "                SELECT *\n",
    "                WHERE{                \n",
    "                        \n",
    "                    ?tcontext <http://www.w3.org/2006/time#inXSDDateTime> ?inxsdtime.    \n",
    "                }\n",
    "            \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
